zupcorp23012025.Расширение1/src/Documents/Аптека_НачислениеЗарплатыВрачи/Аптека_НачислениеЗарплатыВрачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Аптека_НачислениеЗарплатыВрачи</name>
  <registerRecords>InformationRegister.НачисленияЗППоАптекам</registerRecords>
  <registerRecords>AccumulationRegister.ЗГ_УдержанияСотрудниковОрганизации</registerRecords>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаЧасовМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧАптека</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядКатегория</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядПодразделение</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимумПоСотруднику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумПоСотруднику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоПоРасчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимумПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДоГраниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад0_166_Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад0_166Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеДеньЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеДеньСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиДеньЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиДеньСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЗаОтработанноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУслугВрача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаУслугиВрача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОчковыеЛинзы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаОчковыеЛинзы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоБонусов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доплата1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доплата2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяАптека</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Уволенная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкладПоЧасам</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоплатаЗаКатегорию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементВыбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/Documents/Аптека_НачислениеЗарплатыВрачи/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	////АК Начало Хаустов С.А.
	//Движения.ЗГ_УдержанияСотрудниковОрганизации.Записывать = Истина;
	////АК Конец Хаустов С.А.
	
	// регистр НачисленияЗППоАптекам
	Движения.НачисленияЗППоАптекам.Записывать = Истина;
	Для Каждого ТекСтрокаТЧАптека Из ТЧАптека Цикл
		Движение = Движения.НачисленияЗППоАптекам.Добавить();
		Движение.Период = ДатаС;
		Движение.Подразделение = Подразделение;
		Движение.ФизическоеЛицо = ТекСтрокаТЧАптека.Сотрудник;
		Движение.Должность = ТекСтрокаТЧАптека.Должность;
		Движение.ОсновнаяАптека = ТекСтрокаТЧАптека.ОсновнаяАптека;
		Движение.ТН = ТекСтрокаТЧАптека.ТН;
		Движение.ИНН = ТекСтрокаТЧАптека.ИНН;
		Движение.ВсегоПоРасчету = ТекСтрокаТЧАптека.ВсегоПоРасчету;
		Движение.МинимумПоФакту = ТекСтрокаТЧАптека.МинимумПоФакту;
		Движение.МаксимумПоФакту = ТекСтрокаТЧАптека.МаксимумПоФакту;
		Движение.ИтогоДоГраниц = ТекСтрокаТЧАптека.ИтогоДоГраниц;
		Движение.ОтработаноВсего = ТекСтрокаТЧАптека.ОтработаноВсего;
		Движение.ИтогоЗаОтработанноеВремя = ТекСтрокаТЧАптека.ИтогоЗаОтработанноеВремя;
		Движение.Минимум = Минимум;
		Движение.Оклад0_166_Часы = ТекСтрокаТЧАптека.Оклад0_166_Часы;
		Движение.Оклад0_166Сумма = ТекСтрокаТЧАптека.Оклад0_166Сумма;
		//Движение.Оклад2Часы = ТекСтрокаТЧАптека.Оклад2Часы;
		//Движение.Оклад2Сумма = ТекСтрокаТЧАптека.Оклад2Сумма;
		//Движение.Оклад3_Часы = ТекСтрокаТЧАптека.Оклад3_Часы;
		//Движение.Оклад3_Сумма = ТекСтрокаТЧАптека.Оклад3_Сумма;
		//Движение.Ночь_Часы = ТекСтрокаТЧАптека.Ночь_Часы;
		//Движение.Ночь_Сумма = ТекСтрокаТЧАптека.Ночь_Сумма;
		Движение.ПраздникиДеньЧасы=ТекСтрокаТЧАптека.ПраздникиДеньЧасы;
		Движение.ПраздникиДеньСумма=ТекСтрокаТЧАптека.ПраздникиДеньСумма;
		//Движение.ПраздникиНочьЧасы=ТекСтрокаТЧАптека.ПраздникиНочьЧасы;
		//Движение.ПраздникиНочьСумма=ТекСтрокаТЧАптека.ПраздникиНочьСумма;
		Движение.ВыходныеДеньЧасы=ТекСтрокаТЧАптека.ВыходныеДеньЧасы;
		Движение.ВыходныеДеньСумма=ТекСтрокаТЧАптека.ВыходныеДеньСумма;
		Движение.ИтогоБонусов = ТекСтрокаТЧАптека.ИтогоБонусов;
		//Движение.БонусНеДТМ = ТекСтрокаТЧАптека.БонусНеДТМ;
		//Движение.БонусДТМ = ТекСтрокаТЧАптека.БонусДТМ;
		//Движение.БонусАкции = ТекСтрокаТЧАптека.БонусАкции;
		//Движение.БонусЗМЗ = ТекСтрокаТЧАптека.БонусЗМЗ;
		//Движение.БонусОценка = ТекСтрокаТЧАптека.БонусОценка;
		Движение.Доплата1 = ТекСтрокаТЧАптека.Доплата1;
		Движение.Доплата2 = ТекСтрокаТЧАптека.Доплата2;
		Движение.ПремияМин = ТекСтрокаТЧАптека.ПремияМин;
		Движение.ПремияМакс = ТекСтрокаТЧАптека.ПремияМакс;
		Движение.ОкладПоЧасам = ТекСтрокаТЧАптека.ОкладПоЧасам;
		Движение.ОбщаяПремия = ТекСтрокаТЧАптека.ОбщаяПремия; 
		//Движение.ДоплатаЗаКатегорию = ТекСтрокаТЧАптека.ДоплатаЗаКатегорию;
		Движение.Статус1 = ТекСтрокаТЧАптека.Статус1;
		Движение.Статус2 = ТекСтрокаТЧАптека.Статус2;
		Движение.БонусЗаУслугиВрача=ТекСтрокаТЧАптека.БонусЗаУслугиВрача;
		Движение.БонусЗаОчковыеЛинзы=ТекСтрокаТЧАптека.БонусЗаОчковыеЛинзы;
		
		////АК Начало Хаустов С.А.
		//Если ЗначениеЗаполнено(ТекСтрокаТЧАптека.Доплата2) Тогда
		//	Движение = Движения.ЗГ_УдержанияСотрудниковОрганизации.ДобавитьРасход();
		//	Движение.Период = ДатаС;
		//	Движение.ФизическоеЛицо = ТекСтрокаТЧАптека.Сотрудник;
		//	Движение.Сумма = - ТекСтрокаТЧАптека.Доплата2;
		//КонецЕсли;
		////АК Конец Хаустов С.А.

    КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
